app/Controllers/Lokasi.php

INSERT INTO `tbl_lokasi` (`nama_lokasi`, `alamat_lokasi`, `latitude`, `longitude`, `foto_lokasi`, `jumlah_lapangan`, `jam_mulai`, `jam_selesai`, `harga_sewa`, `harga_sewa_wk`, `kontak_pemesanan`, `metode_pemesanan`, `kantin`, `toilet`, `parkir`, `kecamatan`) VALUES ('Zero Futsal & Badminton', 'Jl. Dr. Mr. Mohd Hasan No.17-18, Lampeuneurut Gampong, Kec. Darul Imarah, Kota Banda Aceh, Aceh 23242', '5.527253101789406', '95.3309538020549', '1751906908_f61f66565a585bd5788f.png', '2', '08:00', '02:00', '60000', '70000', '082268260477', 'online', 1, 1, 1, 'Darul Imarah')
---
            'kecamatan'          => $this->request->getPost('kecamatan')
        ];

        $this->ModelLokasi->insert($data);