app/Controllers/User.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_lokasi`
SELECT *
FROM `tbl_lokasi`
SELECT *
FROM `tbl_lokasi`
 LIMIT 12, 6
---
    public function index()
    {
        $data = [
            'judul' => 'User',
            'lokasi' => $this->ModelLokasi->getAllData(), // ini ditambahkan
            'daftar' => $this->ModelLokasi->paginate(6),
            'pager' => $this->ModelLokasi->pager,
        ];