app/Controllers/User.php

SELECT DISTINCT `kecamatan`
FROM `tbl_lokasi`
---
    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $filter_kecamatan = $this->request->getGet('kecamatan');
        $max_harga = $this->request->getGet('max_harga');

        $model = $this->ModelLokasi;

        // Buat query dasar untuk filter
        $builder = $model->getFilteredQuery($keyword, $filter_kecamatan, $max_harga);

        // Clone builder untuk map
        $builderForMap = clone $builder;
        $dataForMap = $builderForMap->get()->getResultArray();

        // Pagination
        $page = (int) ($this->request->getGet('page') ?? 1);
        $perPage = 6;
        $offset = ($page - 1) * $perPage;

        $total = $builder->countAllResults(false);
        $pagedData = $builder->limit($perPage, $offset)->get()->getResultArray();

        $pager = \Config\Services::pager();
        $pager->makeLinks($page, $perPage, $total, 'default_full');

        $data = [
            'judul' => 'User',
            'daftar' => $pagedData,
            'semua_data' => $dataForMap,
            'pager'  => $pager,
            'keyword' => $keyword,
            'kecamatanList' => $model->distinct()->select('kecamatan')->findAll(),
        ];