app/Models/ModelLokasi.php

    public function insertData($data)
    {
        $this->db->table($this->table)->insert($data);
---
INSERT INTO `tbl_lokasi` (`nama_lokasi`, `alamat_lokasi`, `latitude`, `longitude`, `foto_lokasi`, `jumlah_lapangan`, `jam_mulai`, `jam_selesai`, `harga_sewa`, `kontak_pemesanan`, `kantin`, `toilet`, `parkir`) VALUES ('ahsjka', ' sjkansaj', '5.557142581729972', '95.30485709066413', '1750258412_1c7bffb1ca804165f5b0.jpg', '1', '13:58', '15:00', '20000', '0882487246', 0, 0, 0)

    public function getAllData()
    {
        return $this->db->table($this->table)->get()->getResultArray();
---
SELECT *
FROM `tbl_lokasi`