app/Models/ModelLokasi.php

    public function getLastInputDate()
    {
        return $this->db->table($this->table)
            ->orderBy('created_at', 'DESC') // atau sesuaikan dengan nama kolom tanggalmu
            ->limit(1)
            ->get()
            ->getRow(); // pakai getRow() karena hanya ambil satu baris
---
SELECT *
FROM `tbl_lokasi`
ORDER BY `created_at` DESC
 LIMIT 1

    public function getTotal()
    {
        return $this->db->table($this->table)->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_lokasi`

    public function getAllData()
    {
        return $this->findAll();
---
SELECT *
FROM `tbl_lokasi`

    public function getWilayahTercakup()
    {
        return $this->db->table($this->table)
            ->select('kecamatan')
            ->groupBy('kecamatan')
            ->get()
            ->getNumRows();
---
SELECT TRIM(LOWER(kecamatan)) AS kecamatan
FROM `tbl_lokasi`
WHERE `kecamatan` != ''
GROUP BY TRIM(LOWER(kecamatan))